Revit 2027 API
TopographySurface.AssociatedBuildingPadId Property
 The element id of the building pad which causes this topography surface to be formed.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId AssociatedBuildingPadId { get; }
Public ReadOnly Property AssociatedBuildingPadId As ElementId
	Get
public:
property ElementId^ AssociatedBuildingPadId {
	ElementId^ get ();
}
member AssociatedBuildingPadId : ElementId with get
Property Value
ElementId
Remarks
 InvalidElementId returned signals that there is no associated building pad.
See Also
Reference
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace